#### 4.17. Домашняя работа 4.3

**Дополнительное задание***

**Цель задания**

Закрепить пройденные темы: арифметические операции, циклы, условные операторы, константы.

**Что нужно сделать**

Вы доставляете гуманитарную помощь в ящиках одинакового размера. У вас есть грузовики и контейнеры. В каждый грузовик помещается максимум 12 контейнеров. В каждый контейнер — не более 27 ящиков. Ящики, контейнеры и грузовики пронумерованы.

Напишите программу, которая распределит ящики по контейнерам и грузовикам в зависимости от их количества. Программа должна выводить необходимое для этого число грузовиков и контейнеров.

**Принцип работы программы**

Указываем число ящиков — получаем результат в виде строк:

    Грузовик 1:
        Контейнер 1:
            Ящик 1
            Ящик 2
            Ящик 3
    ...
        Контейнер 2
            Ящик 28
            Ящик 29
    ...
    Необходимо:
    грузовиков — 1 шт.
    контейнеров — 10 шт.

**Рекомендации:**

Для добавления отступа в строке вы можете использовать символ табуляции «\t».

Обратите внимание на арифметическую операцию «Остаток от деления»

```java
System.out.println(45 % 10); // вывод будет 5.
```

**Критерии оценки**

«Зачёт» — количество грузовиков и контейнеров верно выводится при любом количестве ящиков.  
«Незачёт» — задание не выполнено.
